Repository: trankov/QuickLookers
Catalog: App/Localizable.xcstrings
Source language: en
Languages: ru

source: * = any characters · ? = 1 character · ~ = 1 optional · / = escape (/~, /*, /?)
ru: * = любые символы · ? = 1 символ · ~ = 1 необязательный · / = экранирование (/~, /*, /?)

source: action button
ru: кнопка действия

source: active users with order counts
ru: активные пользователи с числом заказов

source: Add rule
ru: Добавить правило

source: Allow
ru: Разрешить

source: Allow access to the Applications folder — to find installed editors.
ru: Разрешите доступ к папке «Программы» — чтобы найти установленные редакторы.

source: Allow access to your home folder — to read the editor's theme and font.
ru: Разрешите доступ к домашней папке — чтобы прочитать тему и шрифт редактора.

source: App Group container is unavailable — changes aren't saved. Check the signature and entitlement.
ru: Контейнер App Group недоступен — изменения не сохраняются. Проверь подпись и entitlement.

source: Can be previewed with Space in Finder.
ru: Возможно показать по пробелу в Finder.

source: Can't preview with Space: the system defines it as '%@'.
ru: Невозможно показать по пробелу: определено в системе как «%@».

source: Cancel
ru: Отмена

source: Couldn't read the file.
ru: Не удалось прочитать файл.

source: Default
ru: По умолчанию

source: Defaults (first %lld shown)
ru: По умолчанию (показаны первые %lld)

source: Delete
ru: Удалить

source: Delete rule
ru: Удалить правило

source: Disable highlighting
ru: Отключить подсветку

source: Disable rule
ru: Выключить правило

source: don't highlight
ru: не подсвечивать

source: Edit
ru: Изменить

source: Editors not found or no access to the Applications folder.
ru: Редакторы не найдены или нет доступа к папке «Программы».

source: Enable rule
ru: Включить правило

source: Find a highlighting format…
ru: Найти формат подсветки…

source: Find a pattern (extension or file name), or a highlighting format…
ru: Найти шаблон (расширение или имя файла), или формат подсветки…

source: Font:
ru: Шрифт:

source: Formats
ru: Форматы

source: From editor…
ru: Из редактора…

source: Hello, world
ru: Привет, мир

source: Hello, {$name}{$marks}
ru: Привет, {$name}{$marks}

source: Highlight
ru: Подсвечивать

source: Highlighting rule
ru: Правило подсветки

source: Home folder access wasn't granted.
ru: Доступ к домашней папке не разрешён.

source: Hundreds of formats are highlighted by default. Use search to reassign a format, or add your own highlighting rule.
ru: Сотни форматов подсвечиваются по умолчанию. Используйте поиск, чтобы переназначить формат, или добавьте своё правило подсветки.

source: Import .vsix…
ru: Импортировать .vsix…

source: imported
ru: импортирована

source: My rules
ru: Мои правила

source: Name/extension pattern to highlight
ru: Шаблон имя/расширение, который будем подсвечивать

source: No custom rules yet.
ru: Своих правил пока нет.

source: No shared container — import unavailable.
ru: Нет общего контейнера — импорт недоступен.

source: No themes or grammars to import were found in the file.
ru: В файле не нашлось тем или грамматик для импорта.

source: Now: %@
ru: Сейчас: %@

source: Now: neutral (no rule)
ru: Сейчас: нейтрально (нет правила)

source: Others…
ru: Другие…

source: package.json wasn't found in the extension.
ru: В расширении не найден package.json.

source: Patterns
ru: Шаблоны

source: Preview
ru: Превью

source: Remove imported '%@'
ru: Удалить импортированный «%@»

source: Run
ru: Запустить

source: Sample language
ru: Язык образца

source: Save
ru: Сохранить

source: Search highlighting formats
ru: Поиск формата подсветки

source: Size:
ru: Размер:

source: The editor has no theme set — applied font only.
ru: У редактора не задана тема — применён только шрифт.

source: The extension has no themes or grammars to import.
ru: В расширении нет тем и грамматик для импорта.

source: The file is too large or corrupted.
ru: Файл слишком большой или повреждён.

source: Theme
ru: Тема

source: Theme '%@' couldn't be read — applied font only.
ru: Тема «%@» не прочиталась — применён только шрифт.

source: Theme '%@' wasn't found — applied font only.
ru: Тема «%@» не найдена — применён только шрифт.

source: This doesn't look like a .vsix extension file.
ru: Это не похоже на файл расширения .vsix.

source: This pattern isn't supported: Space preview won't work.
ru: Этот шаблон не поддерживается: просмотр по пробелу не сработает.

source: user greeting
ru: приветствие пользователя

source: word count in a string
ru: подсчёт слов в строке
